![title](./pic/merging/cross_join/1_title.png)

In [1]:
import pandas as pd
import time
from IPython.display import Image

In [2]:
df_ids = pd.read_csv('./csv/merge_function/df_ids.csv', index_col=0)
df_passenger = pd.read_csv('./csv/merge_function/df_passenger.csv', index_col=0)

<br>

---

## Merge function: `cross_join`

![title](./pic/merging/cross_join/2_cross.png)

<video width="1000" controls src="./pic/merging/cross_join/3_cross_example.mp4" />

In [4]:
df_passenger.head()

   PassengerId                                       Name     Sex
0          935      Corbett, Mrs. Walter H (Irene Colvin)  female
1         1023                  Gracie, Col. Archibald IV    male
2         1136  Johnston, Master. William Arthur Willie""    male
3         1044                         Storey, Mr. Thomas    male
4          954               Bjorklund, Mr. Ernst Herbert    male

In [5]:
df_ids.head()

   PassengerId  Survived
0         1297         0
1         1260         1
2         1153         0
3         1139         0
4          998         0

In [8]:
pd.merge(df_ids,
         df_passenger,
         how='cross',
         )

,PassengerId_x,Survived,PassengerId_y,Name,Sex
0,1297,0,935,"Corbett, Mrs. Walter H (Irene Colvin)",female
1,1297,0,1023,"Gracie, Col. Archibald IV",male
2,1297,0,1136,"Johnston, Master. William Arthur Willie""""",male
3,1297,0,1044,"Storey, Mr. Thomas",male
4,1297,0,954,"Bjorklund, Mr. Ernst Herbert",male
...,...,...,...,...,...
191814,1040,0,974,"Case, Mr. Howard Brown",male
191815,1040,0,1148,"Mahon, Mr. John",male
191816,1040,0,1238,"Botsford, Mr. William Hull",male
191817,1040,0,977,"Khalil, Mr. Betros",male
191818,1040,0,1095,"Quick, Miss. Winifred Vera",female

![title](./pic/merging/cross_join/4_cp.png)